[
  {
    "name": "Frontend Development",
    "slug": "frontend-development",
    "description": "Client-side web technologies focused on user interfaces and user experience. This category covers JavaScript frameworks, libraries, and tools used to build interactive, responsive web applications that run in the browser.",
    "logo": "React logo"
  },
  {
    "name": "Backend Development",
    "slug": "backend-development",
    "description": "Server-side technologies and frameworks that handle business logic, data processing, and API development. These technologies power the behind-the-scenes functionality that enables web applications to process requests and manage data.",
    "logo": "server icon"
  },
  {
    "name": "Mobile Development",
    "slug": "mobile-development", 
    "description": "Native and cross-platform mobile application development frameworks and tools. This category includes technologies for building iOS and Android apps, from native solutions to hybrid frameworks that work across multiple platforms.",
    "logo": "mobile phone icon"
  },
  {
    "name": "Database Systems",
    "slug": "database-systems",
    "description": "Data storage and management solutions including relational and NoSQL databases. These technologies handle data persistence, querying, and management for applications of all scales, from simple web apps to enterprise systems.",
    "logo": "database icon"
  },
  {
    "name": "DevOps & Cloud",
    "slug": "devops-cloud",
    "description": "Infrastructure, deployment, and cloud services that enable scalable application development and operations. This category covers containerization, CI/CD pipelines, cloud platforms, and tools for automating software delivery and infrastructure management.",
    "logo": "cloud icon"
    },
  {
    "name": "AI/ML & Data Science",
    "slug": "ai-ml-data-science",
    "description": "Machine learning frameworks, data analysis tools, and artificial intelligence platforms. These technologies enable developers to build intelligent applications, analyze large datasets, and implement machine learning models for various use cases.",
    "logo": "brain/AI icon"
  },
  {
    "name": "Testing Frameworks",
    "slug": "testing-frameworks",
    "description": "Quality assurance and testing tools that ensure application reliability and performance. This category includes unit testing, integration testing, end-to-end testing, and performance testing frameworks used throughout the development lifecycle.",
    "logo": "checkmark icon"
    },
  {
    "name": "CSS Frameworks",
    "slug": "css-frameworks",
    "description": "Styling and UI component libraries that accelerate frontend development and ensure consistent design. These frameworks provide pre-built components, utility classes, and design systems for creating modern, responsive user interfaces.",
    "logo": "paint brush icon"
    }
]